import wikipedia
>>> while True:
...         input = raw_input("Question:")
...         wikipedia.set_lang("ta")
...         print wikipedia.summary(input)
... 
Question:tree
நியோக்னத்துகள் என்பவை ஆவேஸ் வகுப்பில் நியோர்னிதிஸ் என்ற துணைவகுப்பின் கீழ் வரும் பறவைகள் ஆகும். நியோக்னதாய் என்ற பின்வகுப்பு கிட்டத்தட்ட அனைத்து வாழும் பறவைகளையும் உள்ளடக்கியுள்ளது; விதிவிலக்குகள் இவைகளின் சகோதரி வகைப்பாடான (பாலியோக்னதாய்) ஆகும். பாலியோக்னதாய் தினமு மற்றும் பறக்கமுடியாத ராட்டைட்களைக் உள்ளடக்கியுள்ளது.
Question:srilanka
இலங்கைப் பரீட்சைத் திணைக்களம் (Department of Examinations, Srilanka, சிங்களம்: ශ්‍රී ලංකා විභාග දෙපාර්තමේන්තුව) என்பது தேர்வுகள் தொடர்பான ஓர் இலங்கை அரசுத் திணைக்களம் ஆகும்.

